---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetServiceGUID(System.Int32)
source: html/bc7b8b27-7e65-06eb-4962-84302ea0e802.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetServiceGUID Method

Gets the service GUID by its identifier.

## Syntax (C#)
```csharp
public Guid GetServiceGUID(
	int serviceId
)
```

## Parameters
- **serviceId** (`System.Int32`) - The service identifier.

## Returns
The service GUID. Returns empty GUID if not found.